<?php require_once 'php/utils.php'; ?>
<?php require_once 'php/auth.php'; ?>
<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <meta name="csrf-token" content="<?php echo createToken(); ?>">
        <title>Правила</title>
        <link rel="stylesheet" type="text/css" href="css/bootstrap.min.css">
        <link rel="stylesheet" type="text/css" href="css/style.css">
    </head>
    <body>
        <?php require 'navbar.php'; ?>
        <nav aria-label="breadcrumb">
            <ol class="breadcrumb">
                <li class="breadcrumb-item"><a href="/index.php">Главная</a></li>
                <li class="breadcrumb-item active">Правила</li>
            </ol>
        </nav>
        <h1 class="text-center mt-2 mb-1">Правила</h1>
        <div class="container-fluid px-3 mb-4">
            <h5 class="mb-0">Буква закона</h5>
            <small class="text-muted">Явно выраженные перечислением правила пользования сайтом</small>
            <h6 class="my-2">Публикуемый контент</h6>
            <p class="my-0">Эти правила касаются любых данных, которые вы отправляете на сайт, будь то 
                домашнее задание к предмету, комментарии, файлы или даже ваш никнейм</p>
            <p class="my-0">1) Запрещена публикация 18+ материалов (порнография, сцены насилия и тд)</p>
            <p class="my-0">2) Запрещены любые акты агрессии по отношению к пользователям сайта</p>
            <p class="my-0">3) Для студентов группы: поле "имя" при регистрации должно содержать ваши реальные имя и фамилию и ничего кроме них</p>
            <p class="my-0">4) Запрещена публикация ложной информации в отношении учебных материалов 
                или замена действительных данных на ложные или удаление действительных учебных материалов. 
                Наказанием может быть лишение прав на публикацию и редактирование учебных материалов на сайте.</p>
            <h6 class="my-2">Прочее</h6>
            <p class="my-0">1) Запрещено злоупотребление техническими ресурсами сервера. 
                Любая попытка нагрузить сервер вне меры разумного расценивается как атака на сайт. 
                Это влечёт за собой занесение IP адреса атакующего в чёрный список брандмауэра сайта.</p>
            <h5 class="mb-0">Дух закона</h5>
            <small class="text-muted">Общее описание смысла правил и их цели</small>
            <p class="my-0">Невозможно описать всевозможные тонкости адекватного поведения на сайте. 
                Но если указать цель и общий смысл, возможно принять адекватное решение, не описанное буквой закона.</p>
            <h6 class="my-2">Для студентов</h6>
            <p class="my-0">Наш сайт предназначен для сбора учебных материалов нашего университета и их всеобщего пользования. 
                Из этого автоматически вытекает, что любая попытка помешать успешной каталогизации материалов и доступа к ним 
                расценивается как враждебное поведение, нарушающее правила сайта.</p>
            <p class="my-0">Кроме того наш сайт могут посещать прочие люди, в том числе преподаватели. Поэтому демонстрировать 
                неадекватное поведение (в том числе употребление ненормативной лексики) 
                крайне не рекомендуется. Вероятность получить блокировку на публикацию стремится к 100&#37;</p>
            <h6 class="my-2">Для всех остальных</h6>
            <p class="my-0">Наш сайт в основном предназначен для пользования студентами нашей группы. 
                Вам предоставлен доступ к некоторым публикациям, тем не менее возможность публиковать 
                для пользователей, не состоящих в нашей группе, не запланирована.</p>
        </div>

        <?php require 'footer.php'; ?>
        <script src="js/mainscript.js"></script>
        <?php require 'php/importImportantJsScripts.php'; ?>
    </body>
</html>